<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<title>encapsulation </title>
</head>
<body>
	<h1>Encapsulation - what is it?</h1>
	<p>Инкапсуляция - сокрытие полей и методов от других классов.То есть, если поле или метод создавалось для работы только в данном классе, то и другим классам не нужно о нем знать. Это позволяет меньше зависеть от других классов и делает структуру более гибкий к изменениям.</p>
	<p>Из минусов,хочу отметить, это сложности при проектировании классов. Проектирование класса, как и проектирование языка, требует большого опыта. Это итеративный процесс, где приходится учиться на своих же ошибках.</p>

</body>
</html>